config.el
(server-start)
(defun raise-emacs-on-aqua()
  (shell-command "osascript -e 'tell application \"Emacs\" to activate' &"))
(add-hook 'server-switch-hook 'raise-emacs-on-aqua)

(add-to-list 'load-path "~/.emacs.d/lisp")

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)

(defvar backup-dir "~/.emacs.d/backups")
(setq backup-directory-alist (list (cons "." backup-dir)))
(setq make-backup-files nil)
(setq ispell-program-name "/usr/local/bin/aspell")

;;;; Function
(electric-pair-mode 1)
(show-paren-mode 1)
(global-auto-revert-mode 1)
(setq shell-multiple-shells t)

(setq confirm-kill-emacs 'yes-or-no-p)
(setq auto-save-default nil)
;; When editing symlinks, allow Emacs to access Git things
(setq vc-follow-symlinks t)
;; *scratch* buffers start in org mode
(setq initial-major-mode 'org-mode)
(setq default-major-mode 'org-mode)

(add-to-list 'write-file-functions 'delete-trailing-whitespace)

(setq echo-keystrokes 0.02)

(put 'narrow-to-page 'disabled nil)
(put 'set-goal-column 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
(setq-default dired-listing-switches "-alGFh")

(setq browse-url-mailto-function 'browse-url-generic)
(setq browse-url-generic-program "open")
(setq ns-pop-up-frames nil)
(setq message-log-max t)
(setq ok-if-already-exists t)


;; Restoring sessions
(setq desktop-save 'if-exists)
(desktop-save-mode 1)
(setq desktop-restore-eager 1)
(add-hook 'auto-save-hook (lambda () (desktop-save-in-desktop-dir)))
(setq desktop-globals-to-save
      (append '((extended-command-history . 30)
		(file-name-history        . 100)
		(grep-history             . 30)
		(compile-history          . 30)
		(minibuffer-history       . 50)
		(query-replace-history    . 60)
		(read-expression-history  . 60)
		(regexp-history           . 60)
		(regexp-search-ring       . 20)
		(search-ring              . 20)
		(shell-command-history    . 50)
		tags-file-name
		register-alist)))

(when (>= emacs-major-version 27)
  (setq what-cursor-show-names 1)
  (setq auto-save-no-message 1)
  (global-tab-line-mode 1))

(global-font-lock-mode 1)
(global-hl-line-mode 1)
(column-number-mode 1)
(global-display-line-numbers-mode 1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(blink-cursor-mode -1)
(setq prettify-symbols-unprettify-at-point 'right-edge)
(global-prettify-symbols-mode)
(fringe-mode '(0 . 0))

;; Startup
(setq inhibit-splash-screen 1)
(setq inhibit-startup-message 1)
(setq initial-scratch-message "")
(setq truncate-partial-width-windows 20)
(setq-default truncate-lines nil)
(add-to-list 'default-frame-alist '(font . "Andale Mono-12"))
(set-fontset-font "fontset-default" 'unicode "Apple Color Emoji" nil 'prepend)
(add-to-list 'default-frame-alist '(left-fringe . 0))
(add-hook 'after-init-hook '(lambda () (org-agenda nil "n")))

;; Smooth scrolling
(setq scroll-margin 2)
(setq scroll-step 1)
(setq scroll-conservatively 10000)
(setq scroll-preserve-screen-position 1)
(setq hscroll-step 1)
(setq ring-bell-function 'ignore)
(setq redisplay-dont-pause 1)

(setq-default display-line-numbers-type 'visual)
(setq-default display-line-numbers-current-absolute t)
(setq-default display-line-numbers-widen t)

(add-hook 'prog-mode-hook 'hs-minor-mode)
(eval-after-load "hideshow"
  '(add-to-list 'hs-special-modes-alist
		`(ruby-mode
		  ,(rx (or "def" "class" "if" "module" "do" "{" "[")) ; Block start
		  ,(rx (or "}" "]" "end"))                       ; Block end
		  ,(rx (or "#" "=begin"))                        ; Comment start
		  ruby-forward-sexp nil)))

(setq package-enable-at-startup nil)

(add-to-list 'package-archives
	     '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives
	     '("melpa-stable" . "http://stable.melpa.org/packages/") t)
(add-to-list 'package-archives
	     '("org" . "https://orgmode.org/elpa/") t)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))

(use-package org
  :ensure org-plus-contrib
  ;; :pin org
  :ensure auctex
  :ensure htmlize
  :config
  (require 'ox-extra)
  (require 'ol-zoommtg)
  (require 'org-tempo)
  (require 'latex)
  (ox-extras-activate '(ignore-headlines))
  ;; (setcar org-emphasis-regexp-components " \t('\"{[:alpha:]")
  ;; (setcar (nthcdr 1 org-emphasis-regexp-components) "[:alpha:]- \t.,:!?;'\")}\\")
  ;; (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)
  (add-hook 'org-mode-hook 'visual-line-mode)
  (add-hook 'org-mode-hook 'turn-on-flyspell)
  (add-hook 'org-mode-hook 'highlight-symbol-mode)
  (add-hook 'org-mode-hook 'LaTeX-math-mode)
  (add-hook 'org-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'org-mode-hook (lambda ()
			     (setq-local electric-pair-pairs (append
							      electric-pair-pairs
							      '((?\$ . ?\$))))))
  (add-hook 'org-mode-hook (lambda ()
			     (modify-syntax-entry ?< "_")))
  (add-hook 'org-mode-hook (lambda ()
			     (modify-syntax-entry ?> "_")))
  (add-hook 'org-mode-hook (lambda ()
			     (setq ispell-extra-args '("-t"))))
  (setq org-agenda-files
	'("~/Todo/school/" "~/Todo/life" "~/Todo/work" "~/apps/apps.org"))
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-span 7)
  (setq org-agenda-start-day "0d")
  (setq org-agenda-start-on-weekday nil)
  (setq org-agenda-todo-ignore-deadlines t)
  (setq org-agenda-hide-tags-regexp "ignore\\|noexport")
  (setq org-blank-before-new-entry
	'((heading . t) (plain-list-item . auto)))
  (setq org-todo-keywords
	'((sequence "TODO" "IN-PROGRESS" "|" "DONE")))
  (setq org-deadline-warning-days 4)
  (setq org-export-in-background t)
  (setq org-link-file-path-type 'adaptive)
  (setq org-log-done 'time)
  (setq org-pretty-entities 1))
(setq org-src-tab-acts-natively t)
(org-reload)

(use-package diminish
  :ensure t
  :config
  (diminish 'flyspell-mode)
  (diminish 'highlight-symbol-mode)
  (diminish 'visual-line-mode)
  (diminish 'reftex-mode)
  (diminish 'iimage-mode)
  (diminish 'abbrev-mode))

(use-package latex
  :defer 1
  :ensure auctex
  :config
  (setq TeX-tree-roots '("~/.texlive2017" "~/texlive2016" "~/.texlive2018"))
  (setq-default TeX-master "../main")
  (setq-default TeX-PDF-mode t)
  (setq TeX-parse-self t)
  (setq TeX-auto-untabify t)
  (setq TeX-insert-braces nil)
  (setq TeX-source-correlate-mode t)

  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'reftex-mode)
  (add-hook 'LaTeX-mode-hook 'prettify-symbols-mode)
  (add-hook 'LaTeX-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-flyspell)
  (add-hook 'LaTeX-mode-hook 'abbrev-mode)
  (add-hook 'bibtex-mode-hook 'hs-minor-mode)
  (add-hook 'LaTeX-mode-hook
	    (lambda ()
	      (add-to-list 'TeX-output-view-style
			   '("^pdf$" "."
			     "/Applications/Skim.app/Contents/SharedSupport/displayline %n %o %b")))
	    )

  (add-to-list 'auto-mode-alist '("\\.tex\\'" . LaTeX-mode))
  (add-to-list 'auto-mode-alist '("\\.sty\\'" . LaTeX-mode))
  (add-to-list 'auto-mode-alist '("\\.bbl\\'" . LaTeX-mode))

  (add-to-list 'safe-local-variable-values '(TeX-command-extra-options . (regexp-quote "-jobname='[^']*'")))

  (setq LaTeX-electric-left-right-brace nil)

  (setq LaTeX-math-list
	'((?, "qc" "" nil)
	  (?6 "partial" "" nil)
	  (?= "implies" "" nil)
	  (?8 "infty" "" nil)
	  (?T "dagger" "" nil)
	  (?e "varepsilon" "" nil))))
