config.org
** General
#+BEGIN_SRC emacs-lisp
  (use-package general
    :ensure t
    :config
    (general-auto-unbind-keys))
#+END_SRC

** Exec-path-from-shell
#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :ensure t
    :config
    (exec-path-from-shell-initialize))
#+END_SRC

** Evil
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t

    :init
    (setq evil-want-integration nil)
    (setq evil-search-module 'evil-search)
    (setq evil-want-Y-yank-to-eol 1)


    :config
    (evil-ex-define-cmd "h[elp]" 'help)
    (evil-ex-define-cmd "W[rite]" 'evil-save)
    (evil-ex-define-cmd "e[dit]" 'ido-find-file)
    (evil-ex-define-cmd "E[dit]" 'ido-find-file)
    (evil-ex-define-cmd "b[uffer]" 'ido-switch-buffer)
    (evil-ex-define-cmd "B[uffer]" 'ido-switch-buffer)

    (setq evil-emacs-state-modes (list 'magit-popup-mode))
    (setq evil-insert-state-modes nil)
    (setq evil-motion-state-modes nil)

    (setq evil-vsplit-window-left -1)

    (evil-mode 1))
#+END_SRC
*** Evil-leader
#+BEGIN_SRC emacs-lisp
  (use-package evil-leader
    :requires evil
    :ensure t
    :config
    (evil-leader/set-key "SPC" 'evil-ex-nohighlight)
    (global-evil-leader-mode 1))
#+END_SRC
*** Evil-commentary
#+BEGIN_SRC emacs-lisp
  (use-package evil-commentary
    :requires evil
    :ensure t
    :diminish
    :config
    (evil-commentary-mode)
    (add-hook 'LaTeX-mode-hook (lambda () (setq comment-start "%% "))))
#+END_SRC
*** Evil-surround
#+BEGIN_SRC emacs-lisp
  (use-package evil-surround
    :requires evil
    :ensure t
    :config
    (global-evil-surround-mode 1)
    (add-hook 'LaTeX-mode-hook (lambda ()
				 (push '(?$ . ("$" . "$")) evil-surround-pairs-alist))))
#+END_SRC
*** Evil-easy-motion
#+BEGIN_SRC emacs-lisp
  (use-package evil-easymotion
    :requires evil
    :ensure t
    :config
    (evilem-default-keybindings "SPC"))
#+END_SRC
*** TODO Evil-goggles
#+BEGIN_SRC emacs-lisp
  (use-package evil-goggles
    :requires evil
    :ensure t
    :diminish
    :config
    (setq evil-goggles-duration 0.100)
    (evil-goggles-mode))
#+END_SRC
*** Evil indenting
#+BEGIN_SRC emacs-lisp
  (use-package evil-indent-plus
    :ensure t
    :config
    (evil-indent-plus-default-bindings))
#+END_SRC
** Ivy
*** Ivy
#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :ensure t
    :diminish
    :config
    (ivy-mode 1))
#+END_SRC
*** Swiper
#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :diminish
    :ensure t)
#+END_SRC
*** Counsel
#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :diminish
    :ensure t
    :config
    (counsel-mode 1))
#+END_SRC
** Python
*** Elpy
#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :ensure t
    :config
    (elpy-enable))
#+END_SRC
*** TODO Jedi
#+BEGIN_SRC emacs-lisp
  (use-package jedi
    :ensure t)
#+END_SRC
*** Autopep8
#+BEGIN_SRC emacs-lisp
  (use-package py-autopep8
    :ensure t
    :config
    (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save))
#+END_SRC
** Which-key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :diminish
    :config
    (which-key-mode 1))
#+END_SRC

** Highlight-symbol
#+BEGIN_SRC emacs-lisp
  (use-package highlight-symbol
    :ensure t
    :defer 1
    :config
    (setq-default highlight-symbol-idle-delay 0.5)
    (highlight-symbol-mode 1))
#+END_SRC

** Markdown
#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
    :ensure t)
#+END_SRC

** Rainbow delimiters
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC

** Browse kill ring
#+BEGIN_SRC emacs-lisp
  (use-package browse-kill-ring
    :ensure t)
#+END_SRC

** Color theme
#+BEGIN_SRC emacs-lisp
  (use-package color-theme-sanityinc-tomorrow
    :ensure t
    :config
    (color-theme-sanityinc-tomorrow-eighties))
#+END_SRC

** Undo tree
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :ensure t
    :diminish
    :config
    (global-undo-tree-mode))
#+END_SRC

** Dimmer
#+BEGIN_SRC emacs-lisp
  (use-package dimmer
    :ensure t
    :config
    (dimmer-mode)
    (setq dimmer-fraction 0.4))
#+END_SRC

** XML
#+BEGIN_SRC emacs-lisp
  (use-package xml+
    :ensure t)
#+END_SRC

** TODO YASnippet
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (setq yas-snippet-dirs '("~/.emacs.d/snippets")))
#+END_SRC

** Magic LaTeX buffer
#+BEGIN_SRC emacs-lisp
  (use-package magic-latex-buffer
    :ensure t
    :config
    (add-hook 'LaTeX-mode-hook 'magic-latex-buffer)
    (when (require 'diminish nil 'noerror)
      (diminish 'magic-latex-buffer)))
#+END_SRC

** Julia mode
#+BEGIN_SRC emacs-lisp
  (use-package julia-mode
    :defer 1
    :ensure t)
#+END_SRC

** Magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :general
    ("C-x g" 'magit-status))
#+END_SRC

*** Evil magit
#+BEGIN_SRC emacs-lisp
  (use-package evil-magit
    :ensure t)
#+END_SRC

** Ido
#+BEGIN_SRC emacs-lisp
  (use-package ido
    :ensure t
    :config
    (ido-mode t)
    (ido-everywhere t)
    (setq ido-default-buffer-method 'selected-window)
    (setq ido-enable-flex-matching t))
#+END_SRC

** CSV
#+BEGIN_SRC emacs-lisp
  (use-package csv-mode
    :ensure t)
#+END_SRC

** HTMLize
#+BEGIN_SRC emacs-lisp
  (use-package htmlize
    :ensure t)
#+END_SRC
* Keybindings
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; General
   :states '(normal visual)
   "<down>" 'evil-next-visual-line
   "RET" 'hmm-lower-line
   "<up>" 'evil-previous-visual-line
   "C-h" 'evil-window-left
   "C-j" 'evil-window-down
   "C-k" 'evil-window-up
   "C-l" 'evil-window-right
   "C-t" 'transpose-chars
   "M-n" 'make-frame
   "M-x" 'counsel-M-x
   "j" 'evil-next-visual-line
   "k" 'evil-previous-visual-line
   "/" 'swiper)
#+END_SRC
** Org agenda
*** Opening
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Getting to org agenda
   :prefix "C-c"
   "a" 'org-agenda
   "c" 'org-capture
   "h" 'help)
#+END_SRC

*** Navigating
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Org agenda
   :keymaps 'org-agenda-mode-map
   :states 'normal
   "j" 'evil-next-line
   "k" 'evil-previous-line
   "t" 'org-agenda-todo
   "q" 'org-agenda-quit
   "<return>" 'org-agenda-switch-to
   "f" 'org-agenda-fortnight-view
   "r" 'org-agenda-redo
   "<right>" 'org-agenda-later
   "<down>" 'org-agenda-later
   "<up>" 'org-agenda-earlier
   "<left>" 'org-agenda-earlier)
#+END_SRC

** Org mode
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Org
   :keymaps 'org-mode-map
   :states 'insert
   "<return>" 'newline-and-indent)

  (general-define-key ;; Org
   :keymaps 'org-mode-map
   :states 'normal
   "[" 'org-previous-visible-heading
   "]" 'org-next-visible-heading)
#+END_SRC

** Buffer menu
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Buffer menu
   :keymaps 'Buffer-menu-mode-map
   :states 'normal
   "k" 'evil-previous-line
   "<return>" 'Buffer-menu-this-window)
#+END_SRC

** Help menus
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Help
   :keymaps 'help-mode-map
   :states 'normal
   "<return>" 'push-button
   "q" 'quit-window)
#+END_SRC

** Dired mode
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Dired
   :keymaps 'dired-mode-map
   :states 'normal
   "<return>" 'dired-find-file)
#+END_SRC

** Package menu
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; Package menu
   :keymaps 'package-menu-mode-map
   :states 'normal
   "<BS>" 'package-menue-backup-unmark
   "<return>" 'package-menu-describe-package
   "U" 'package-menu-mark-upgrades
   "i" 'package-menu-mark-install
   "u" 'package-menu-mark-upgrades
   "d" 'package-menu-mark-delete
   "x" 'package-menu-execute)
#+END_SRC

** LaTeX
*** LaTeX mode
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; LaTeX mode
   :keymaps 'LaTeX-mode-map
   :states 'normal
   "*" 'LaTeX-environment)
#+END_SRC

*** RefTeX TOC mode
#+BEGIN_SRC emacs-lisp
  (general-define-key ;; reftex TOC mode
   :keymaps 'reftex-toc-mode-map
   :states 'normal
   "SPC" 'reftex-toc-view-line
   "TAB" 'reftex-toc-goto-line
   "RET" 'reftex-toc-goto-line-and-hide
   "<" 'reftex-toc-promote
   ">" 'reftex-toc-demote
   "C-c >" 'reftex-toc-display-index
   "q" 'reftex-toc-quit
   "l" 'reftex-toc-toggle-labels
   "i" 'reftex-toc-toggle-index
   "c" 'reftex-toc-toggle-context
   "F" 'reftex-toc-toggle-file-borders
   "t" 'reftex-toc-max-level
   "f" 'reftex-toc-toggle-follow
   "g" 'revert-buffer
   "a" 'reftex-toggle-auto-toc-recenter
   "d" 'reftex-toggle-dedicated-frame
   "r" 'reftex-toc-rescan
   "." 'reftex-toc-show-calling-point
   "j" 'reftex-toc-next
   "k" 'reftex-toc-previous)
#+END_SRC

** Grep mode
#+BEGIN_SRC emacs-lisp
  (general-unbind 'normal 'grep-mode-map
    :with 'ignore
    "<return>"
    )
#+END_SRC
** Version \ge 27
#+BEGIN_SRC emacs-lisp
  (when (>= emacs-major-version 27)
    (general-define-key ;; Changing tabs
     :keymaps 'override
     "C-<left>" 'previous-buffer
     "C-<right>" 'next-buffer))
#+END_SRC

* My own code
** Move the current line down
#+BEGIN_SRC emacs-lisp
  (defun hmm-lower-line ()
    "Add a line above, without moving point"
    (interactive "*")
    (let ((col (current-column)))
      (beginning-of-line)
      (newline)
      (move-to-column col)))
#+END_SRC

