config.el

(use-package general
  :ensure t
  :config
  (general-auto-unbind-keys))

(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-initialize))

(use-package evil
  :ensure t

  :init
  (setq evil-want-integration nil)
  (setq evil-search-module 'evil-search)
  (setq evil-want-Y-yank-to-eol 1)


  :config
  (evil-ex-define-cmd "h[elp]" 'help)
  (evil-ex-define-cmd "W[rite]" 'evil-save)
  (evil-ex-define-cmd "e[dit]" 'ido-find-file)
  (evil-ex-define-cmd "E[dit]" 'ido-find-file)
  (evil-ex-define-cmd "b[uffer]" 'ido-switch-buffer)
  (evil-ex-define-cmd "B[uffer]" 'ido-switch-buffer)

  (setq evil-emacs-state-modes (list 'magit-popup-mode))
  (setq evil-insert-state-modes nil)
  (setq evil-motion-state-modes nil)

  (setq evil-vsplit-window-left -1)

  (evil-mode 1))

(use-package evil-leader
  :requires evil
  :ensure t
  :config
  (evil-leader/set-key "SPC" 'evil-ex-nohighlight)
  (global-evil-leader-mode 1))

(use-package evil-commentary
  :requires evil
  :ensure t
  :diminish
  :config
  (evil-commentary-mode)
  (add-hook 'LaTeX-mode-hook (lambda () (setq comment-start "%% "))))

(use-package evil-surround
  :requires evil
  :ensure t
  :config
  (global-evil-surround-mode 1)
  (add-hook 'LaTeX-mode-hook (lambda ()
			       (push '(?$ . ("$" . "$")) evil-surround-pairs-alist))))

(use-package evil-easymotion
  :requires evil
  :ensure t
  :config
  (evilem-default-keybindings "SPC"))

(use-package evil-goggles
  :requires evil
  :ensure t
  :diminish
  :config
  (setq evil-goggles-duration 0.100)
  (evil-goggles-mode))

(use-package evil-indent-plus
  :ensure t
  :config
  (evil-indent-plus-default-bindings))

(use-package ivy
  :ensure t
  :diminish
  :config
  (ivy-mode 1))

(use-package swiper
  :diminish
  :ensure t)

(use-package counsel
  :diminish
  :ensure t
  :config
  (counsel-mode 1))

(use-package elpy
  :ensure t
  :config
  (elpy-enable))

(use-package jedi
  :ensure t)

(use-package py-autopep8
  :ensure t
  :config
  (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save))

(use-package which-key
  :ensure t
  :diminish
  :config
  (which-key-mode 1))

(use-package highlight-symbol
  :ensure t
  :defer 1
  :config
  (setq-default highlight-symbol-idle-delay 0.5)
  (highlight-symbol-mode 1))

(use-package markdown-mode
  :ensure t)

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package browse-kill-ring
  :ensure t)

(use-package color-theme-sanityinc-tomorrow
  :ensure t
  :config
  (color-theme-sanityinc-tomorrow-eighties))

(use-package undo-tree
  :ensure t
  :diminish
  :config
  (global-undo-tree-mode))

(use-package dimmer
  :ensure t
  :config
  (dimmer-mode)
  (setq dimmer-fraction 0.4))

(use-package xml+
  :ensure t)

(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs '("~/.emacs.d/snippets")))

(use-package magic-latex-buffer
  :ensure t
  :config
  (add-hook 'LaTeX-mode-hook 'magic-latex-buffer)
  (when (require 'diminish nil 'noerror)
    (diminish 'magic-latex-buffer)))

(use-package julia-mode
  :defer 1
  :ensure t)

(use-package magit
  :ensure t
  :general
  ("C-x g" 'magit-status))

(use-package evil-magit
  :ensure t)

(use-package ido
  :ensure t
  :config
  (ido-mode t)
  (ido-everywhere t)
  (setq ido-default-buffer-method 'selected-window)
  (setq ido-enable-flex-matching t))

(use-package csv-mode
  :ensure t)

(use-package htmlize
  :ensure t)

(general-define-key ;; General
 :states '(normal visual)
 "<down>" 'evil-next-visual-line
 "RET" 'hmm-lower-line
 "<up>" 'evil-previous-visual-line
 "C-h" 'evil-window-left
 "C-j" 'evil-window-down
 "C-k" 'evil-window-up
 "C-l" 'evil-window-right
 "C-t" 'transpose-chars
 "M-n" 'make-frame
 "M-x" 'counsel-M-x
 "j" 'evil-next-visual-line
 "k" 'evil-previous-visual-line
 "/" 'swiper)

(general-define-key ;; Getting to org agenda
 :prefix "C-c"
 "a" 'org-agenda
 "c" 'org-capture
 "h" 'help)

(general-define-key ;; Org agenda
 :keymaps 'org-agenda-mode-map
 :states 'normal
 "j" 'evil-next-line
 "k" 'evil-previous-line
 "t" 'org-agenda-todo
 "q" 'org-agenda-quit
 "<return>" 'org-agenda-switch-to
 "f" 'org-agenda-fortnight-view
 "r" 'org-agenda-redo
 "<right>" 'org-agenda-later
 "<down>" 'org-agenda-later
 "<up>" 'org-agenda-earlier
 "<left>" 'org-agenda-earlier)

(general-define-key ;; Org
 :keymaps 'org-mode-map
 :states 'insert
 "<return>" 'newline-and-indent)

(general-define-key ;; Org
 :keymaps 'org-mode-map
 :states 'normal
 "[" 'org-previous-visible-heading
 "]" 'org-next-visible-heading)

(general-define-key ;; Buffer menu
 :keymaps 'Buffer-menu-mode-map
 :states 'normal
 "k" 'evil-previous-line
 "<return>" 'Buffer-menu-this-window)

(general-define-key ;; Help
 :keymaps 'help-mode-map
 :states 'normal
 "<return>" 'push-button
 "q" 'quit-window)

(general-define-key ;; Dired
 :keymaps 'dired-mode-map
 :states 'normal
 "<return>" 'dired-find-file)

(general-define-key ;; Package menu
 :keymaps 'package-menu-mode-map
 :states 'normal
 "<BS>" 'package-menue-backup-unmark
 "<return>" 'package-menu-describe-package
 "U" 'package-menu-mark-upgrades
 "i" 'package-menu-mark-install
 "u" 'package-menu-mark-upgrades
 "d" 'package-menu-mark-delete
 "x" 'package-menu-execute)

(general-define-key ;; LaTeX mode
 :keymaps 'LaTeX-mode-map
 :states 'normal
 "*" 'LaTeX-environment)

(general-define-key ;; reftex TOC mode
 :keymaps 'reftex-toc-mode-map
 :states 'normal
 "SPC" 'reftex-toc-view-line
 "TAB" 'reftex-toc-goto-line
 "RET" 'reftex-toc-goto-line-and-hide
 "<" 'reftex-toc-promote
 ">" 'reftex-toc-demote
 "C-c >" 'reftex-toc-display-index
 "q" 'reftex-toc-quit
 "l" 'reftex-toc-toggle-labels
 "i" 'reftex-toc-toggle-index
 "c" 'reftex-toc-toggle-context
 "F" 'reftex-toc-toggle-file-borders
 "t" 'reftex-toc-max-level
 "f" 'reftex-toc-toggle-follow
 "g" 'revert-buffer
 "a" 'reftex-toggle-auto-toc-recenter
 "d" 'reftex-toggle-dedicated-frame
 "r" 'reftex-toc-rescan
 "." 'reftex-toc-show-calling-point
 "j" 'reftex-toc-next
 "k" 'reftex-toc-previous)

(general-unbind 'normal 'grep-mode-map
  :with 'ignore
  "<return>"
  )

(when (>= emacs-major-version 27)
  (general-define-key ;; Changing tabs
   :keymaps 'override
   "C-<left>" 'previous-buffer
   "C-<right>" 'next-buffer))

(defun hmm-lower-line ()
  "Add a line above, without moving point"
  (interactive "*")
  (let ((col (current-column)))
    (beginning-of-line)
    (newline)
    (move-to-column col)))
