config.org
** TODO Add a current timestamp to a TeX file
Should update so it's more general (not just TeX)
#+BEGIN_SRC emacs-lisp
  (defun hmm-tex-add-timestamp ()
    "Add a timestamp to the last line of a tex file"
    (interactive "*")
    (when (eq major-mode 'latex-mode)
      (save-excursion
	(save-window-excursion
	  (save-restriction
	    (end-of-buffer)
	    (move-beginning-of-line nil)
	    (if (not (search-forward "%% Last updated: " nil t 1))
		(progn
		  (move-end-of-line nil)
		  (insert "\n%% Last updated: "))
	      (kill-line))
	    (insert (current-time-string))))))
    nil)
#+END_SRC

** Kill other buffers
#+BEGIN_SRC emacs-lisp
  (defun kill-other-buffers ()
    "Kill all other buffers."
    (interactive)
    (mapc ’kill-buffer (delq (current-buffer) (buffer-list))))
#+END_SRC

** Kill dired buffers
#+BEGIN_SRC emacs-lisp
  (defun kill-dired-buffers ()
    "Kill all open dired buffers."
    (interactive)
    (mapc (lambda (buffer)
	    (when (eq 'dired-mode (buffer-local-value ’major-mode buffer))
	      (kill-buffer buffer)))
	  (buffer-list)))
#+END_SRC

# Local Variables:
# org-adapt-indentation: nil
# End:
